/**
 * Created by fa on 2017/3/22.
 */
function Dsy(){
    this.Items = {};
};
Dsy.prototype.add = function(id,iArray){
    this.Items[id] = iArray;
};
Dsy.prototype.Exists = function(id){
    if(typeof(this.Items[id]) == "undefined") return false;
    return true;
};

var dsy = new Dsy();

dsy.add("0",["北京","天津","上海","重庆","河北","山西","内蒙古","辽宁","吉林","黑龙江","江苏","浙江","安徽","福建","江西","山东","河南","湖北","湖南","广东","广西","海南","四川","贵州","云南","西藏","陕西","甘肃","青海","宁夏","新疆","香港","澳门","台湾","深圳"]);
dsy.add("1",["东城","西城","崇文","宣武","朝阳","丰台","石景山","海淀","门头沟","房山","通州","顺义","昌平","大兴","怀柔","平谷","密云","延庆","延庆镇"]);
dsy.add("2",["和平","河东","河西","南开","河北","红桥","塘沽","汉沽","大港","东丽","西青","津南","北辰","武清","宝坻","蓟","宁河","芦台镇","静海","静海镇"]);
dsy.add("3",["黄浦","卢湾","徐汇","长宁","静安","普陀","闸北","虹口","杨浦","闵行","宝山","嘉定","浦东新","金山","松江","青浦","南汇","奉贤","崇明","城桥镇"]);
dsy.add("4",["渝中","大渡口","江北","沙坪坝","九龙坡","南岸","北碚","万盛","双桥","渝北","巴南","万州","涪陵","黔江","长寿","合川","永川","江津","南川","綦江","潼南","铜梁","大足","荣昌","璧山","垫江","武隆","丰都","城口","梁平","开县","巫溪","巫山","奉节","云阳","忠县","石柱土家族自治县","彭水苗族土家族自治县","酉阳土家族苗族自治县","秀山土家族苗族自治县"]);
dsy.add("5",["石家庄","张家口","承德","秦皇岛","唐山","廊坊","保定","衡水","沧州","邢台","邯郸"]);
dsy.add("6",["太原","朔州","大同","阳泉","长治","晋城","忻州","晋中","临汾","吕梁","运城"]);
dsy.add("7",["呼和浩特","包头","乌海","赤峰","通辽","呼伦贝尔","鄂尔多斯","乌兰察布","巴彦淖尔","兴安盟","锡林郭勒盟","阿拉善盟"]);
dsy.add("8",["沈阳","朝阳","阜新","铁岭","抚顺","本溪","辽阳","鞍山","丹东","大连","营口","盘锦","锦州","葫芦岛"]);
dsy.add("9",["长春","白城","松原","吉林","四平","辽源","通化","白山","延边州"]);
dsy.add("10",["哈尔滨","齐齐哈尔","七台河","黑河","大庆","鹤岗","伊春","佳木斯","双鸭山","鸡西","牡丹江","绥化","大兴安岭地"]);
dsy.add("11",["南京","徐州","连云港","宿迁","淮安","盐城","扬州","泰州","南通","镇江","常州","无锡","苏州"]);
dsy.add("12",["杭州","湖州","嘉兴","舟山","宁波","绍兴","衢州","金华","台州","温州","丽水"]);
dsy.add("13",["合肥","宿州","淮北","亳州","阜阳","蚌埠","淮南","滁州","马鞍山","芜湖","铜陵","安庆","黄山","六安","巢湖","池州","宣城"]);
dsy.add("14",["福州","南平","莆田","三明","泉州","厦门","漳州","龙岩","宁德"]);
dsy.add("15",["南昌","九江","景德镇","鹰潭","新余","萍乡","赣州","上饶","抚州","宜春","吉安"]);
dsy.add("16",["济南","青岛","聊城","德州","东营","淄博","潍坊","烟台","威海","日照","临沂","枣庄","济宁","泰安","莱芜","滨州","菏泽"]);
dsy.add("17",["郑州","开封","三门峡","洛阳","焦作","新乡","鹤壁","安阳","濮阳","商丘","许昌","漯河","平顶山","南阳","信阳","周口","驻马店","济源"]);
dsy.add("18",["武汉","十堰","襄樊","荆门","孝感","黄冈","鄂州","黄石","咸宁","荆州","宜昌","随州","恩施州"]);
dsy.add("19",["长沙","张家界","常德","益阳","岳阳","株洲","湘潭","衡阳","郴州","永州","邵阳","怀化","娄底","湘西州"]);
dsy.add("20",["广州","深圳","清远","韶关","河源","梅州","潮州","汕头","揭阳","汕尾","惠州","东莞","珠海","中山","江门","佛山","肇庆","云浮","阳江","茂名","湛江"]);
dsy.add("21",["南宁","桂林","柳州","梧州","贵港","玉林","钦州","北海","防城港","崇左","百色","河池","来宾","贺州"]);
dsy.add("22",["海口","三亚","省直辖行政单位"]);
dsy.add("23",["成都","广元","绵阳","德阳","南充","广安","遂宁","内江","乐山","自贡","泸州","宜宾","攀枝花","巴中","达州","资阳","眉山","雅安","阿坝州","甘孜州","凉山州"]);
dsy.add("24",["贵阳","六盘水","遵义","安顺","毕节地","铜仁地","黔东南州","黔南州","黔西南州"]);
dsy.add("25",["昆明","曲靖","玉溪","保山","昭通","丽江","思茅","临沧","德宏州","怒江州","迪庆州","大理州","楚雄州","红河州","文山州","西双版纳州"]);
dsy.add("26",["拉萨","那曲地","昌都地","林芝地","山南地","日喀则地","阿里地"]);
dsy.add("27",["西安","延安","铜川","渭南","咸阳","宝鸡","汉中","榆林","安康","商洛"]);
dsy.add("28",["兰州","嘉峪关","白银","天水","武威","酒泉","张掖","庆阳","平凉","定西","陇南","临夏州","甘南州"]);
dsy.add("29",["西宁","海东地","海北州","海南州","黄南州","果洛州","玉树州","海西州"]);
dsy.add("30",["银川","石嘴山","吴忠","固原","中卫"]);
dsy.add("31",["乌鲁木齐","克拉玛依","喀什地","阿克苏地","和田地","吐鲁番地","哈密地","克孜勒苏柯州","博尔塔拉州","昌吉州","巴音郭楞州","伊犁州","塔城地","阿勒泰地"]);
dsy.add("32",["香港特别行政"]);
dsy.add("33",["澳门特别行政"]);
dsy.add("34",["台北","高雄","台中","花莲","基隆","嘉义","金门","连江","苗栗","南投","澎湖","屏东","台东","台南","桃园","新竹","宜兰","云林","彰化"]);
dsy.add("35",["罗湖","福田","南山","盐田","宝安","龙岗"]);


